# Лабораторна робота №5
# Тема: Робота з бібліотеками Python
# Імпорт 10 бібліотек
# 📦 Стандартні (вже є в Python, не потребують встановлення)
import math
import random
import datetime
import os

# 🌐 Зовнішні (потрібно встановити через pip)
from colorama import Fore, Style # кольоровий текст
import pandas as pd      # для роботи з таблицями (даними)
import numpy as np       # для обчислень з масивами
import matplotlib.pyplot as plt  # для побудови графіків
from faker import Faker  # для генерації фейкових даних
import emoji             #емодзі

# Використання 5 бібліотек

# 1️ math — обчислення квадратного кореня
num = 25
print("Квадратний корінь з", num, "=", math.sqrt(num))

# 2️ random — вибір випадкового числа
print("Випадкове число від 1 до 10:", random.randint(1, 10))

# 3 emoji — додаємо емодзі до тексту
print("Python — це класно!", emoji.emojize(":snake: :sparkles:"))

# 4 colorama — кольоровий текст
print(Fore.GREEN + "Цей текст зелений!" + Style.RESET_ALL)

# 5 numpy — створення масиву та знаходження середнього
arr = np.array([2, 4, 6, 8])
print("Середнє значення масиву:", np.mean(arr))

# 6 matplotlib — побудова простого графіка
x = [1, 2, 3, 4, 5]
y = [n**2 for n in x]
plt.plot(x, y)
plt.title("Графік y = x²")
plt.xlabel("x")
plt.ylabel("y")
plt.show()
